{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|bos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|user_start|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|user_end|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<|assistant_start|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<|assistant_end|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<|python_start|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<|python_end|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "<|output_start|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "<|output_end|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "Regex": "'(?i:[sdmt]|ll|ve|re)|[^\\r\\n\\p{L}\\p{N}]?+\\p{L}+|\\p{N}{1,2}| ?[^\\s\\p{L}\\p{N}]++[\\r\\n]*|\\s*[\\r\\n]|\\s+(?!\\S)|\\s+"
        },
        "behavior": "Isolated",
        "invert": false
      },
      {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": true,
        "use_regex": false
      }
    ]
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": true,
    "ignore_merges": false,
    "vocab": {
      "<|bos|>": 0,
      "<|user_start|>": 1,
      "<|user_end|>": 2,
      "<|assistant_start|>": 3,
      "<|assistant_end|>": 4,
      "<|python_start|>": 5,
      "<|python_end|>": 6,
      "<|output_start|>": 7,
      "<|output_end|>": 8,
      "!": 9,
      "\"": 10,
      "#": 11,
      "$": 12,
      "%": 13,
      "&": 14,
      "'": 15,
      "(": 16,
      ")": 17,
      "*": 18,
      "+": 19,
      ",": 20,
      "-": 21,
      ".": 22,
      "/": 23,
      "0": 24,
      "1": 25,
      "2": 26,
      "3": 27,
      "4": 28,
      "5": 29,
      "6": 30,
      "7": 31,
      "8": 32,
      "9": 33,
      ":": 34,
      ";": 35,
      "<": 36,
      "=": 37,
      ">": 38,
      "?": 39,
      "@": 40,
      "A": 41,
      "B": 42,
      "C": 43,
      "D": 44,
      "E": 45,
      "F": 46,
      "G": 47,
      "H": 48,
      "I": 49,
      "J": 50,
      "K": 51,
      "L": 52,
      "M": 53,
      "N": 54,
      "O": 55,
      "P": 56,
      "Q": 57,
      "R": 58,
      "S": 59,
      "T": 60,
      "U": 61,
      "V": 62,
      "W": 63,
      "X": 64,
      "Y": 65,
      "Z": 66,
      "[": 67,
      "\\": 68,
      "]": 69,
      "^": 70,
      "_": 71,
      "`": 72,
      "a": 73,
      "b": 74,
      "c": 75,
      "d": 76,
      "e": 77,
      "f": 78,
      "g": 79,
      "h": 80,
      "i": 81,
      "j": 82,
      "k": 83,
      "l": 84,
      "m": 85,
      "n": 86,
      "o": 87,
      "p": 88,
      "q": 89,
      "r": 90,
      "s": 91,
      "t": 92,
      "u": 93,
      "v": 94,
      "w": 95,
      "x": 96,
      "y": 97,
      "z": 98,
      "{": 99,
      "|": 100,
      "}": 101,
      "~": 102,
      "آ،": 103,
      "آ¢": 104,
      "آ£": 105,
      "آ¤": 106,
      "آ¥": 107,
      "آ¦": 108,
      "آ§": 109,
      "آ¨": 110,
      "آ©": 111,
      "آھ": 112,
      "آ«": 113,
      "آ¬": 114,
      "آ®": 115,
      "آ¯": 116,
      "آ°": 117,
      "آ±": 118,
      "آ²": 119,
      "آ³": 120,
      "آ´": 121,
      "آµ": 122,
      "آ¶": 123,
      "آ·": 124,
      "آ¸": 125,
      "آ¹": 126,
      "آ؛": 127,
      "آ»": 128,
      "آ¼": 129,
      "آ½": 130,
      "آ¾": 131,
      "آ؟": 132,
      "أ€": 133,
      "أپ": 134,
      "أ‚": 135,
      "أƒ": 136,
      "أ„": 137,
      "أ…": 138,
      "أ†": 139,
      "أ‡": 140,
      "أˆ": 141,
      "أ‰": 142,
      "أٹ": 143,
      "أ‹": 144,
      "أŒ": 145,
      "أچ": 146,
      "أژ": 147,
      "أڈ": 148,
      "أگ": 149,
      "أ‘": 150,
      "أ’": 151,
      "أ“": 152,
      "أ”": 153,
      "أ•": 154,
      "أ–": 155,
      "أ—": 156,
      "أک": 157,
      "أ™": 158,
      "أڑ": 159,
      "أ›": 160,
      "أœ": 161,
      "أ‌": 162,
      "أ‍": 163,
      "أں": 164,
      "أ ": 165,
      "أ،": 166,
      "أ¢": 167,
      "أ£": 168,
      "أ¤": 169,
      "أ¥": 170,
      "أ¦": 171,
      "أ§": 172,
      "أ¨": 173,
      "أ©": 174,
      "أھ": 175,
      "أ«": 176,
      "أ¬": 177,
      "أ­": 178,
      "أ®": 179,
      "أ¯": 180,
      "أ°": 181,
      "أ±": 182,
      "أ²": 183,
      "أ³": 184,
      "أ´": 185,
      "أµ": 186,
      "أ¶": 187,
      "أ·": 188,
      "أ¸": 189,
      "أ¹": 190,
      "أ؛": 191,
      "أ»": 192,
      "أ¼": 193,
      "أ½": 194,
      "أ¾": 195,
      "أ؟": 196,
      "ؤ€": 197,
      "ؤپ": 198,
      "ؤ‚": 199,
      "ؤƒ": 200,
      "ؤ„": 201,
      "ؤ…": 202,
      "ؤ†": 203,
      "ؤ‡": 204,
      "ؤˆ": 205,
      "ؤ‰": 206,
      "ؤٹ": 207,
      "ؤ‹": 208,
      "ؤŒ": 209,
      "ؤچ": 210,
      "ؤژ": 211,
      "ؤڈ": 212,
      "ؤگ": 213,
      "ؤ‘": 214,
      "ؤ’": 215,
      "ؤ“": 216,
      "ؤ”": 217,
      "ؤ•": 218,
      "ؤ–": 219,
      "ؤ—": 220,
      "ؤک": 221,
      "ؤ™": 222,
      "ؤڑ": 223,
      "ؤ›": 224,
      "ؤœ": 225,
      "ؤ‌": 226,
      "ؤ‍": 227,
      "ؤں": 228,
      "ؤ ": 229,
      "ؤ،": 230,
      "ؤ¢": 231,
      "ؤ£": 232,
      "ؤ¤": 233,
      "ؤ¥": 234,
      "ؤ¦": 235,
      "ؤ§": 236,
      "ؤ¨": 237,
      "ؤ©": 238,
      "ؤھ": 239,
      "ؤ«": 240,
      "ؤ¬": 241,
      "ؤ­": 242,
      "ؤ®": 243,
      "ؤ¯": 244,
      "ؤ°": 245,
      "ؤ±": 246,
      "ؤ²": 247,
      "ؤ³": 248,
      "ؤ´": 249,
      "ؤµ": 250,
      "ؤ¶": 251,
      "ؤ·": 252,
      "ؤ¸": 253,
      "ؤ¹": 254,
      "ؤ؛": 255,
      "ؤ»": 256,
      "ؤ¼": 257,
      "ؤ½": 258,
      "ؤ¾": 259,
      "ؤ؟": 260,
      "إ€": 261,
      "إپ": 262,
      "إ‚": 263,
      "إƒ": 264,
      "ؤ s": 265,
      "te": 266,
      "ca": 267,
      "is": 268,
      "al": 269,
      "he": 270,
      "in": 271,
      "us": 272,
      "ؤ is": 273,
      "ar": 274,
      "io": 275,
      "it": 276,
      "ly": 277,
      "mo": 278,
      "ng": 279,
      "ra": 280,
      "st": 281,
      "ue": 282,
      "wo": 283,
      "ؤ b": 284,
      "ؤ e": 285,
      "ؤ o": 286,
      "ؤ t": 287,
      "ؤ te": 288,
      "ؤ ca": 289,
      "ter": 290,
      "ؤ test": 291,
      "Fra": 292,
      "GP": 293,
      "Par": 294,
      "The": 295,
      "Tin": 296,
      "Two": 297,
      "Wr": 298,
      "av": 299,
      "bv": 300,
      "ce": 301,
      "che": 302,
      "el": 303,
      "eca": 304,
      "eng": 305,
      "fo": 306,
      "gra": 307,
      "ho": 308,
      "hs": 309,
      "ke": 310,
      "ky": 311,
      "lus": 312,
      "lue": 313,
      "mal": 314,
      "nce": 315,
      "ong": 316,
      "pit": 317,
      "plus": 318,
      "qu": 319,
      "re": 320,
      "rter": 321,
      "rong": 322,
      "sue": 323,
      "tio": 324,
      "tter": 325,
      "tche": 326,
      "ths": 327,
      "trong": 328,
      "ur": 329,
      "wav": 330,
      "yGP": 331,
      "ؤ in": 332,
      "ؤ mo": 333,
      "ؤ Fra": 334,
      "ؤ fo": 335,
      "ؤ plus": 336,
      "ؤ wav": 337,
      "ؤ sca": 338,
      "ؤ smo": 339,
      "ؤ sho": 340,
      "ؤ sky": 341,
      "ؤ smal": 342,
      "ؤ strong": 343,
      "tegra": 344,
      "als": 345,
      "ing": 346,
      "use": 347,
      "ؤ issue": 348,
      "arly": 349,
      "ious": 350,
      "iting": 351,
      "ؤ beca": 352,
      "ؤ blue": 353,
      "ؤ equ": 354,
      "ؤ early": 355,
      "ؤ of": 356,
      "ؤ obv": 357,
      "ؤ the": 358,
      "ؤ two": 359,
      "ؤ capit": 360,
      "ؤ catche": 361,
      "ؤ tests": 362,
      "Paris": 363,
      "TinyGP": 364,
      "Writing": 365,
      "eleng": 366,
      "tion": 367,
      "ؤ integra": 368,
      "ؤ more": 369,
      "ؤ France": 370,
      "ؤ four": 371,
      "ؤ waveleng": 372,
      "ؤ scatter": 373,
      "ؤ smoke": 374,
      "ؤ shorter": 375,
      "ؤ small": 376,
      "ؤ strongly": 377,
      "ؤ issues": 378,
      "ؤ because": 379,
      "ؤ equals": 380,
      "ؤ obvious": 381,
      "ؤ capital": 382,
      "ؤ catches": 383,
      "TinyGPT": 384,
      "ؤ integration": 385,
      "ؤ wavelengths": 386
    },
    "merges": [
      [
        "ؤ ",
        "s"
      ],
      [
        "t",
        "e"
      ],
      [
        "c",
        "a"
      ],
      [
        "i",
        "s"
      ],
      [
        "a",
        "l"
      ],
      [
        "h",
        "e"
      ],
      [
        "i",
        "n"
      ],
      [
        "u",
        "s"
      ],
      [
        "ؤ ",
        "is"
      ],
      [
        "a",
        "r"
      ],
      [
        "i",
        "o"
      ],
      [
        "i",
        "t"
      ],
      [
        "l",
        "y"
      ],
      [
        "m",
        "o"
      ],
      [
        "n",
        "g"
      ],
      [
        "r",
        "a"
      ],
      [
        "s",
        "t"
      ],
      [
        "u",
        "e"
      ],
      [
        "w",
        "o"
      ],
      [
        "ؤ ",
        "b"
      ],
      [
        "ؤ ",
        "e"
      ],
      [
        "ؤ ",
        "o"
      ],
      [
        "ؤ ",
        "t"
      ],
      [
        "ؤ ",
        "te"
      ],
      [
        "ؤ ",
        "ca"
      ],
      [
        "te",
        "r"
      ],
      [
        "ؤ te",
        "st"
      ],
      [
        "F",
        "ra"
      ],
      [
        "G",
        "P"
      ],
      [
        "P",
        "ar"
      ],
      [
        "T",
        "he"
      ],
      [
        "T",
        "in"
      ],
      [
        "T",
        "wo"
      ],
      [
        "W",
        "r"
      ],
      [
        "a",
        "v"
      ],
      [
        "b",
        "v"
      ],
      [
        "c",
        "e"
      ],
      [
        "c",
        "he"
      ],
      [
        "e",
        "l"
      ],
      [
        "e",
        "ca"
      ],
      [
        "e",
        "ng"
      ],
      [
        "f",
        "o"
      ],
      [
        "g",
        "ra"
      ],
      [
        "h",
        "o"
      ],
      [
        "h",
        "s"
      ],
      [
        "k",
        "e"
      ],
      [
        "k",
        "y"
      ],
      [
        "l",
        "us"
      ],
      [
        "l",
        "ue"
      ],
      [
        "m",
        "al"
      ],
      [
        "n",
        "ce"
      ],
      [
        "o",
        "ng"
      ],
      [
        "p",
        "it"
      ],
      [
        "p",
        "lus"
      ],
      [
        "q",
        "u"
      ],
      [
        "r",
        "e"
      ],
      [
        "r",
        "ter"
      ],
      [
        "r",
        "ong"
      ],
      [
        "s",
        "ue"
      ],
      [
        "t",
        "io"
      ],
      [
        "t",
        "ter"
      ],
      [
        "t",
        "che"
      ],
      [
        "t",
        "hs"
      ],
      [
        "t",
        "rong"
      ],
      [
        "u",
        "r"
      ],
      [
        "w",
        "av"
      ],
      [
        "y",
        "GP"
      ],
      [
        "ؤ ",
        "in"
      ],
      [
        "ؤ ",
        "mo"
      ],
      [
        "ؤ ",
        "Fra"
      ],
      [
        "ؤ ",
        "fo"
      ],
      [
        "ؤ ",
        "plus"
      ],
      [
        "ؤ ",
        "wav"
      ],
      [
        "ؤ s",
        "ca"
      ],
      [
        "ؤ s",
        "mo"
      ],
      [
        "ؤ s",
        "ho"
      ],
      [
        "ؤ s",
        "ky"
      ],
      [
        "ؤ s",
        "mal"
      ],
      [
        "ؤ s",
        "trong"
      ],
      [
        "te",
        "gra"
      ],
      [
        "al",
        "s"
      ],
      [
        "in",
        "g"
      ],
      [
        "us",
        "e"
      ],
      [
        "ؤ is",
        "sue"
      ],
      [
        "ar",
        "ly"
      ],
      [
        "io",
        "us"
      ],
      [
        "it",
        "ing"
      ],
      [
        "ؤ b",
        "eca"
      ],
      [
        "ؤ b",
        "lue"
      ],
      [
        "ؤ e",
        "qu"
      ],
      [
        "ؤ e",
        "arly"
      ],
      [
        "ؤ o",
        "f"
      ],
      [
        "ؤ o",
        "bv"
      ],
      [
        "ؤ t",
        "he"
      ],
      [
        "ؤ t",
        "wo"
      ],
      [
        "ؤ ca",
        "pit"
      ],
      [
        "ؤ ca",
        "tche"
      ],
      [
        "ؤ test",
        "s"
      ],
      [
        "Par",
        "is"
      ],
      [
        "Tin",
        "yGP"
      ],
      [
        "Wr",
        "iting"
      ],
      [
        "el",
        "eng"
      ],
      [
        "tio",
        "n"
      ],
      [
        "ؤ in",
        "tegra"
      ],
      [
        "ؤ mo",
        "re"
      ],
      [
        "ؤ Fra",
        "nce"
      ],
      [
        "ؤ fo",
        "ur"
      ],
      [
        "ؤ wav",
        "eleng"
      ],
      [
        "ؤ sca",
        "tter"
      ],
      [
        "ؤ smo",
        "ke"
      ],
      [
        "ؤ sho",
        "rter"
      ],
      [
        "ؤ smal",
        "l"
      ],
      [
        "ؤ strong",
        "ly"
      ],
      [
        "ؤ issue",
        "s"
      ],
      [
        "ؤ beca",
        "use"
      ],
      [
        "ؤ equ",
        "als"
      ],
      [
        "ؤ obv",
        "ious"
      ],
      [
        "ؤ capit",
        "al"
      ],
      [
        "ؤ catche",
        "s"
      ],
      [
        "TinyGP",
        "T"
      ],
      [
        "ؤ integra",
        "tion"
      ],
      [
        "ؤ waveleng",
        "ths"
      ]
    ]
  }
}